trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ЗаказНаДоставкуОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаДоставкуОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9108def1-74b6-49f6-826d-411b4f378a62">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf2dbe71-1e2e-44dd-8f86-3a17b80c2b50">
    <name>ПрибытиеНаВыгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80353671-e282-4b56-8dce-2a57668ab838">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfe24e2d-676b-48a5-a9b8-3c5f0b13acc6">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="455e72aa-afaf-45cd-9f49-31780b117de1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88892e7e-ed4c-4ff9-9e78-07befff4e04a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a2e9879-cef7-42dd-905f-482b6a2f455a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86982b60-862a-4887-ba01-a08bc79f03c6">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f108f560-b4a5-4574-bd00-9c07fe772f24">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9430bac8-9a15-40d7-aa10-3adfdb59c859">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcf9d9ba-0906-4ffc-9e5e-737f64099517">
    <name>ПрибытиеНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d780eac6-c9c8-4c2f-852c-10736a66bfd6">
    <name>ИнтервалНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2044c9b2-8129-4e36-9f45-71da4032cde7">
    <name>ВремяНаПогрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="735e0970-9985-412c-a81f-2c90d6cb07d3">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7b12af0-6c5d-49b7-a923-925de351a6bf">
    <name>НаименованиеГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0258e270-c945-45b7-9b29-400d7f52e81c">
    <name>ВремяНаВыгрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb5d3130-09a9-492d-b99b-014e0a261c51">
    <name>ВремяНаПогрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0143b187-4422-4fe8-969a-7ba96e241605">
    <name>АдресНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e03a7-c4af-4ed3-b43a-e18714951dd2">
    <name>ТелефонНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d79523-9883-43fe-aed3-302fe7eb6ebe">
    <name>ИнтервалНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0375cd-d0c9-4885-97e6-dfa91b0458f7">
    <name>ВремяНаВыгрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe254e26-2b30-4311-a001-839a5b565611">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c30b0ea6-027c-49fa-8637-dc11fd260b8c">
    <name>КонтрагентКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d40ac935-ba6c-4dfc-95dc-42dd2c509023">
    <name>ФилиалВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84a4d445-3c12-4ced-b011-00a1d0cc5f10">
    <name>АдресНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe589a13-9652-4e80-a67c-daaecc2e76dc">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03649d03-61d7-4d00-aad8-b57d6b16b8cc">
    <name>СсылкаБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb39d2e-07c5-4a8e-91cd-fbeecd9241ff">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec493491-1e4b-4c54-afa5-c6540c966861">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a47fe91-e454-4a30-948a-b860a45251f9">
    <name>НаправлениеДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b68ea76-f8ba-4e00-a6e6-0bfa3d88a69d">
    <name>ДоверенностьНаСумму</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="331761b3-207b-4f40-b3a4-cfa35eae35cb">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3eeb0f84-a6a0-44ea-bc0e-3a7c773ae588">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf76a4e-cc67-4e12-871f-a782770ccfd1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c16b4556-8131-40e1-b044-7e7acc8ab2d6">
    <name>КоличествоДнейНаВывозЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="481ac138-6530-4efd-abc8-d5cb7f871411">
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="a848cef6-15c4-4d0f-8f9f-3ccb4cf548c2">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bae39f0f-a7b4-46fc-afc5-0fc2017cb0ee">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставкеОтПоставщика/ЗаказыКДоставкеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50a3f077-bb00-4b3c-b903-1f8e8c12863e">
  <name>ЗаказыКДоставкеОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="e8c86484-2d9c-456e-9712-89af750bfba4">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="187706c0-aafe-470e-8971-fbe20c0f1360">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ec5f0146-6d60-4055-83fd-72118391b753">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	Документы.ЗаказНаДоставкуОтПоставщика.ЗаполнитьДанныеПоОснованию(Основание, ЭтотОбъект);
	
КонецПроцедуры

//Проверки
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Проверки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если Транзит Тогда
		Если Не ЗначениеЗаполнено(ТелефонНаВыгрузке) Тогда
			АльтерраОбщегоНазначения.СообщитьПользователю(Ссылка, "Не заполнено поле Телефон на выгрузке", "Объект.ТелефонНаВыгрузке");
			Отказ= Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Расчеты
	Если Не Отказ Тогда 
		Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(ЭтотОбъект);
	КонецЕсли; 
	
	//ЕстьНакладныеЭТрН(Отказ);
	
КонецПроцедуры

Процедура ЕстьНакладныеЭТрН(Отказ)
	
	Если НЕ Отказ И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =	
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Результат
			|ИЗ
			|	Документ.Saby_ТранспортнаяНакладная.ЗаказыНаДоставкуОтПоставщика КАК Накладная
			|ГДЕ
			|	Накладная.Заказ = &Заказ
			|	И НЕ Накладная.Ссылка.ПометкаУдаления";

		Запрос.УстановитьПараметр("Заказ", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По заказу есть накладные!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Расчеты
&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если Не Проведен И Не ПометкаУдаления И Не ОбменДанными.Загрузка Тогда
			Сообщить("Запрещено распроводить документ!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

//Проведение
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Проверим нет ли документов продажи в других заказах
	Документы.ЗаказНаДоставкуОтПоставщика.КонтрольОстатков(ЭтотОбъект, Отказ);

	Если Не Отказ Тогда
		//ЗаказыКДоставке
		Движения.ЗаказыКДоставкеОтПоставщика.Записывать = Истина;
		Для Каждого ТекСтрокаОснования Из Основания Цикл
			Движение = Движения.ЗаказыКДоставкеОтПоставщика.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ЗаказНаДоставку = Ссылка;
			Движение.Документ = ТекСтрокаОснования.Документ;
			Движение.Количество = 1;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Проверим нет ли активных рейсов
	Документы.ЗаказНаДоставкуОтПоставщика.ПроверитьЧтоЕстьРейсы(Ссылка, Отказ);
	Документы.РейсОтПоставщика.ПроверитьЧтоНетРейсовИлиЗаказовНаДоставку(ЭтотОбъект, Отказ);   
	
КонецПроцедуры

#КонецЕсли
